# 문제
# 두 자연수 A와 B가 있을 때, A%B는 A를 B로 나눈 나머지 이다.
# 예를 들어, 7, 14, 27, 38을 3으로 나눈 나머지는 1, 2, 0, 2이다. 
# 수 10개를 입력받은 뒤, 이를 42로 나눈 나머지를 구한다.
# 그 다음 서로 다른 값이 몇 개 있는지 출력하는 프로그램을 작성하시오.
# 입력
# 첫째 줄부터 열번째 줄 까지 숫자가 한 줄에 하나씩 주어진다.
# 이 숫자는 1,000보다 작거나 같고, 음이 아닌 정수이다.
# 출력
# 첫째 줄에, 42로 나누었을 때, 서로 다른 나머지가 몇 개 있는지 출력한다.

arr = []
for i in range(10):
    n = int(input())
    arr.append(n % 42)
    # append 로 arr배열에 n을 42로 나눈 나머지값들을 저장한다.
arr = set(arr)
# 처음엔 set된 배열을 받는 배열을 새로 만들랬는데, 생각해보니 기존 배열을 굳이 유지하고 있을 필요가 없다.
# 그래서 그냥 arr에 set된 ( 중복을 제거한 ) arr 을 넣었다.
print(len(arr))
# len 함수로 arr의 길이 ( 즉, 원소의 갯수) 를 입력하면 끝